Repository: ahmedasaber/fruits_ecommerce
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Start Now
ar: ابدأ الان

source: Skip
ar: تخط

# onBoardingSubTitlePage1
source: Discover a unique shopping experience with FruitHUB. Explore our wide collection of premium fresh fruits and enjoy the best deals and top quality.
ar: اكتشف تجربة تسوق فريدة مع FruitHUB. استكشف مجموعتنا الواسعة من الفواكه الطازجة الممتازة واحصل على أفضل العروض والجودة العالية.

# onBoardingTitleTextSpan1Page1
source: Welcome to
ar: مرحبًا بك في

# onBoardingSubTitlePage2
source: We bring you the best carefully selected fruits. Check details, images, and reviews to choose your perfect fruit.
ar: قدم لك أفضل الفواكه المختارة بعناية. اطلع على التفاصيل والصور والتقييمات لتتأكد من اختيار الفاكهة المثالية

# onBoardingTitleTextPage2
source: Search and Shop
ar: ابحث وتسوق

# weakPassword
source: The password provided is too weak.
ar: كلمة المرور ضعيفة جدًا.

# emailAlreadyInUse
source: An account already exists for that email.
ar: الحساب موجود بالفعل لهذا البريد الإلكتروني.

# networkError
source: Please check your internet connection.
ar: تأكد من اتصالك بالإنترنت.

# genericError
source: Something went wrong, please try again.
ar: هناك خطأ ما، حاول مرة أخري.

source: Invalid email or password.
ar: البريد الإلكتروني او كلمة مرور غير صحيح.

# invalidCredential
source: Incorrect email or password. Please try again.
ar: البريد الإلكتروني او كلمة مرور غير صحيحه. حاول مرة اخرى.

# facebookAccountExistsDifferentCredential
source: The email address is already associated with a different sign-in method.
ar: تم تسجيل عنوان البريد الإلكتروني هذا بالفعل باستخدام طريقة تسجيل دخول مختلفة

# facebookLoginError
source: An error occurred during Facebook login.
ar: حدث خطأ أثناء تسجيل الدخول عبر فيسبوك.

# newAccountTitleBar
source: New Account
ar: حساب جديد

# fullNameHint
source: Full Name
ar: الاسم كامل

# emailHint
source: Email Address
ar: البريد الالكتروني

# passwordHint
source: password
ar: كلمة المرور

# newAccountButton
source: Create New Account
ar: إنشاء حساب جديد

# mustAcceptTerms
source: You must accept the terms and conditions.
ar: يجب عليك الموافقة على شروط والأحكام

# alreadyHaveAccount
source: Already have an account?
ar: تمتلك حساب بالفعل؟

source: Login
ar: تسجيل دخول

# termsIntro
source: By creating an account, you agree to
ar: من خلال إنشاء حساب ، فإنك توافق على

# termsAndConditions
source: our Terms and Conditions
ar: الشروط والأحكام الخاصة بنا

source: Forgot Password?
ar: نسيت كلمة المرور؟

# noAccount
source: Don’t have an account?
ar: لا تمتلك حساب؟

# createAccount
source: Create an Account
ar: قم بإنشاء حساب

# orDivider
source: Or
ar: أو

source: Sign in with Google
ar: تسجيل بواسطة جوجل

source: Sign in with Apple
ar: تسجيل بواسطة أبل

source: Sign in with Facebook
ar: تسجيل بواسطة فيسبوك

# appleSignInNotDeveloped
source: Apple Sign-In is not developed yet for iOS users.
ar: ميزة تسجيل الدخول بواسطة أبل غير متوفرة بعد لمستخدمي iOS.

# fieldRequired
source: This Field is required
ar: هذا الحقل مطلوب

# notRegisteredEmail
source: This email address is not registered with us.
ar: هذا الإيميل غير مسجل لدينا.

source: Added to cart
ar: تم الإضافة إلى السلة

source: Removed from cart
ar: تم الإزالة من السلة

# errorOccurred
source: An error occurred
ar: حدث خطأ

source: Good morning!..
ar: صباح الخير !..

source: Search for.......
ar: ابحث عن.......

source: Best Selling
ar: الأكثر مبيعًا

source: More
ar: المزيد

# perKilo
source: / kilo
ar: / الكيلو

source: Products
ar: المنتجات

# resultsCount
source: {count} results
ar: {count} نتائج

# logoutConfirmation
source: Do you want to log out?
ar: هل ترغب في تسجيل الخروج ؟

source: Confirm
ar: تأكيد

# doNotWant
source: Cancel
ar: لا أرغب

source: Logout
ar: تسجيل الخروج

source: Invalid email format.
ar: صيغة الإيميل غير صحيحة.

# emailNotRegistered
source: This email is not registered.
ar: هذا الإيميل غير مسجَّل لدينا.

# emailNotRegisteredHere
source: This email is not registered with us.
ar: هذا الإيميل غير مسجل لدينا.

# tooManyRequests
source: Too many attempts. Please try again later.
ar: تم إرسال محاولات كثيرة. حاول لاحقًا.

source: Server error
ar: خطأ من الخادم

# somethingWentWrong
source: Something went wrong, please try again.
ar: هناك خطأ ما، حاول مرة أخرى.

# somethingWentWrongRetry
source: Something went wrong, please try again.
ar: هناك خطأ ما، حاول مرة أخري.

# noInternet
source: No internet connection.
ar: لا يوجد اتصال بالإنترنت.

# unexpectedError
source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

# unexpectedErrorRetry
source: An unexpected error occurred. Try again
ar: حدث خطأ غير متوقع. حاول مرة أخرى.

# recentLoginRequired
source: You must log in again before changing your password.
ar: يجب تسجيل الدخول مرة أخرى قبل تغيير كلمة المرور.

# weakPasswordUpdate
source: Password is too weak. Please choose a stronger password.
ar: كلمة المرور ضعيفة جدًا. يرجى اختيار كلمة أقوى.

# accountDisabled
source: This account is disabled and cannot be modified.
ar: هذا الحساب معطّل ولا يمكن تعديله.

# invalidSession
source: Invalid login session, please log in again.
ar: جلسة الدخول غير صالحة، حاول تسجيل الدخول مرة أخرى.

# currentPasswordIncorrect
source: Current password is incorrect.
ar: كلمة المرور الحاليه غير صحيحه.

# confirmPasswordIncorrect
source: New password confirmation is incorrect
ar: تأكيد كلمة المرور الجديده غير صحيح

source: Password changed successfully.
ar: تم تغير كلمة المرور بنجاح.

source: Change Password
ar: تغيير كلمة المرور

source: Current Password
ar: كلمة المرور الحالي

source: New Password
ar: كلمة المرور الجديده

source: Confirm New Password
ar: تأكيد كلمة المرور الجديده

# forgotPasswordInstructions
source: Don't worry, just enter your email and we'll send you a link to reset your password.
ar: لا تقلق ، ما عليك سوى كتابة بريدك الألكتروني وسنرسل لك رابط لاعاده تعين كلمة المرور.

# resetLinkSent
source: A reset link has been sent to your email to reset your password.
ar: تم ارسال رابط الي بريدك الالكتروني لاعاده تعين كلمة المرور.

# errorCheckCurrentPassword
source: Something went wrong, please try again. Make sure of your current password.
ar: هناك خطأ ما، حاول مرة أخرى. تاكد من كلمه المرور الحاليه.

source: Notifications
ar: الاشعارات

# nothingToShow
source: Nothing to show here!
ar: لا يوجد ما يُعرض هنا!

# willNotifyYou
source: We'll notify you as soon as new notifications arrive.
ar: سنُعلمك فور ورود إشعارات جديدة.

source: About Us
ar: من نحن

# aboutText1
source: 🍎 FruitHub is an online store specialized in selling the finest fresh and seasonal fruits, created to make buying fruits easier and more convenient than ever.
ar: 🍎 تطبيق فواكهك هو متجر إلكتروني متخصص في بيع أجود أنواع الفواكه الطازجة والموسمية، تم إنشاؤه ليجعل عملية شراء الفواكه أكثر سهولة وراحة من أي وقتٍ مضى.

# aboutText2
source: At FruitHub, we believe that health starts with food, so we strive to provide high-quality natural products, carefully selected from the best local and international farms to ensure fresh flavor and complete nutritional value.
ar: في فواكهك نؤمن بأن الصحة تبدأ من الغذاء، ولذلك نسعى لتوفير منتجات طبيعية عالية الجودة، يتم اختيارها بعناية من أفضل المزارع المحلية والعالمية لضمان النكهة الطازجة والفائدة الغذائية المتكاملة.

# aboutText3
source: We always strive to provide a comfortable and safe shopping experience for all our customers, through a simple and fast user interface, with the ability to browse products easily, add favorites, and follow offers and discounts continuously.
ar: نسعى دائمًا لتقديم تجربة تسوّق مريحة وآمنة لكل عملائنا، من خلال واجهة استخدام بسيطة وسريعة، مع إمكانية تصفح المنتجات بسهولة، وإضافة المفضلة، ومتابعة العروض والتخفيضات بشكل مستمر.

# aboutText4
source: We also provide a fast and safe delivery service to your doorstep, ensuring that the fruits reach you fresh as if you had chosen them yourself.
ar: كما نوفر خدمة توصيل سريعة وآمنة إلى باب منزلك، لضمان وصول الفواكه إليك طازجة كما لو كنت قد اخترتها بنفسك.

# aboutText5
source: Our goal is to be the first destination for fresh fruit lovers everywhere, through product quality, ease of use, and the trust we build with every purchase.
ar: هدفنا أن نكون الوجهة الأولى لعشّاق الفواكه الطازجة في كل مكان، من خلال جودة المنتجات، وسهولة الاستخدام، والثقة التي نبنيها مع كل عملية شراء.

# aboutText6
source: 🌿 FruitHub — Your health starts with choosing the best.
ar: 🌿 فواكهك — صحتك تبدأ من اختيار الأفضل.

source: Payment
ar: الدفع

# successfullyCompleted
source: Successful!
ar: تم بنجاح !

source: Order Number
ar: رقم الطلب

source: Home
ar: الرئيسية

source: Full Name
ar: الاسم كامل

source: Email
ar: البريد الإلكتروني

source: Address
ar: العنوان

source: Phone Number
ar: رقم الهاتف

source: City
ar: المدينه

# floorAndApartment
source: Floor Number, Apartment Number..
ar: رقم الطابق , رقم الشقه ..

source: Save Address
ar: حفظ العنوان

source: Shipping
ar: الشحن

source: Delivery Address:
ar: عنوان التوصيل :

source: Edit
ar: تعديل

source: Order Summary:
ar: ملخص الطلب :

source: Subtotal:
ar: المجموع الفرعي :

source: Delivery:
ar: التوصيل :

# deliveryPrice
source: 40 EGP
ar: 40 جنيه

source: Total
ar: الكلي

source: Next
ar: التالي

source: Confirm Order
ar: تأكيد الطلب

source: Pay via PayPal
ar: الدفع عن طريق paypal

# pleaseSelectPayment
source: Please select payment method
ar: يرجى تحديد طريقه الدفع

source: Please select payment method
ar: يرجي تحديد طريقه الدفع

source: Cash on Delivery
ar: الدفع عند الاستلام

source: Delivery from Location
ar: التسليم من المكان

source: Online Payment
ar: الدفع اونلاين

# operationSuccessful
source: Operation completed successfully
ar: تمت العمليه بنجاح

# expirationMonths
source: Month
ar: شهر

source: Validity
ar: الصلاحيه

source: Organic
ar: اوجانيك

source: Calories
ar: كالوري

source: Grams
ar: جرام

source: Add to Cart
ar: أضف الي السلة

source: Review
ar: المراجعه

# main
source: Home
ar: الرئيسية

source: Shopping Cart
ar: سلة التسوق

source: My Account
ar: حسابي

# youHaveProductsInCart
source: You have {count} products in your shopping cart
ar: لديك {count} منتجات في سله التسوق

# totalAmountKg
source: {amount} Kg
ar: {amount} كم

# priceInEGP
source: {price} EGP
ar: {price} جنيه

source: Cart
ar: السلة

source: No products in cart
ar: لا توجد منتجات في السلة

source: Shop Now
ar: تسوق الان

source: Holiday Offers
ar: عروض العيد

# discount25
source: 25% Discount
ar: خصم 25%

# checkoutPrice
source: Pay {price} EGP
ar: الدفع {price} جنيه

source: General
ar: عام

source: Personal Profile
ar: الملف الشخصي

source: My Orders
ar: طلباتي

source: Payments
ar: المدفوعات

source: Favorites
ar: المفضلة

source: Language
ar: اللغة

source: Help
ar: المساعده

source: Sort By:
ar: ترتيب حسب :

source: Price (Low to High)
ar: السعر ( الأقل الي الأعلي )

source: Price (High to Low)
ar: السعر ( الأعلي الي الأقل )

source: Alphabetical
ar: الأبجديه

source: Filter
ar: تصفيه

# noOrdersYet
source: You haven't placed any orders yet!
ar: لم تقم بعمل اي طلب حتي الان!

# orderNumberHash
source: Order No: {orderId}#
ar: طلب رقم: {orderId}#

# orderDate
source: Ordered: {date}
ar: تم الطلب: {date}

# ordersCount
source: Number of Orders:
ar: عدد الطلبات :

source: Save Changes
ar: حفظ التغييرات

source: Search
ar: البحث

source: Recent Searches
ar: عمليات البحث الأخيرة

source: Delete All
ar: حذف الكل

# infoNotAvailable
source: Oops... This information is not available at the moment
ar: عفوًا... هذه المعلومات غير متوفرة للحظة

source: Search Results
ar: نتائج البحث

# chooseLanguage
source: Select Language:
ar: اختر اللغة:

source: success
ar: نجح

source: No Favorites
ar: لا يوجد مفضلات
